import { Question } from './types';

export const SECRET_CODE = "1234";

export const INITIAL_QUESTIONS: Question[] = [
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើនៅអំឡុងសម័យអាណានិគមបារាំង តើមានព្រះមហាក្សត្រខ្មែរប៉ុន្មានព្រះអង្គ?",
    "options": [
      "២",
      "៣",
      "៤",
      "៥"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសកម្ពុជាបានធ្វើជាម្ចាស់ផ្ទះ កីឡា SEA GAME នៅឆ្នាំណា?",
    "options": [
      "២០២១",
      "២០២៤",
      "២០២២",
      "២០២៣"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសកម្ពុជា បានចូលជាសមាជិកអង្គការសហប្រជាជាតិនៅថ្ងៃខែឆ្នាំណា?",
    "options": [
      "១៤ ធ្នូ ១៩៥៥",
      "១៤ ធ្នូ ១៩៥០",
      "១៤ ធ្នូ ១៩៥៩",
      "១៤ ធ្នូ ១៩៥៣"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើការធ្វើជំរឿនប្រជាជនជាសមត្ថកិច្ចរបស់ស្ថាប័នណា?",
    "options": [
      "ក្រសួងអប់រំ",
      "ក្រសួងផែនការ",
      "ក្រសួងកសិកម្ម",
      "ក្រសួងការពារជាតិ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើទឹកដីកម្ពុជាក្រោម (កូសាំងស៊ីន) បាត់បង់នៅថ្ងៃ ខែ ឆ្នាំណា?",
    "options": [
      "០៤ មិថុនា ១៩៤៥",
      "០៩ មិថុនា ១៩៤៩",
      "០៤ មិថុនា ១៩៤៩",
      "០៩ មិថុនា ១៩៤៥"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើកាកបាទក្រហមកម្ពុជាឡើងនៅថ្ងៃខែឆ្នាំណា?",
    "options": [
      "១៨ កុម្ភៈ ១៩៥៦",
      "១៨ កុម្ភៈ ១៩៥៧",
      "១៨ កុម្ភៈ ១៩៥៥",
      "១៨ កុម្ភៈ ១៩៥៨"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើសម្បត្តិបេតិកភណ្ឌពិភពលោកចែងចែកចេញជាប៉ុន្មានប្រភេទ?",
    "options": [
      "២",
      "៣",
      "៤",
      "៥"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើព្រែកជីកហ្វូណនតេជោឆ្លងកាត់ខេត្តណាខ្លះ?",
    "options": [
      "ខេត្តកណ្តាល ខេត្តតាកែវ ខេត្តកំពត និងខេត្តកែប",
      "ខេត្តកណ្តាល ខេត្តតាកែវ ខេត្តកំពត និងខេត្តប៉ៃលិន",
      "ខេត្តប៉ៃលិន ខេត្តតាកែវ ខេត្តកំពត និងខេត្តកែប",
      "ខេត្តកណ្តាល ខេត្តតាកែវ ខេត្តកំពង់ចាម និងខេត្តកែប"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើសង្គ្រាមលោកលើកទី២ ចាប់ផ្ដើមពីឆ្នាំណាដល់ឆ្នាំណា?",
    "options": [
      "១៩៣៩-១៩៤៥",
      "១៩៣៥-១៩៤៩",
      "១៩៣៩-១៩៤៩",
      "១៩៣៥-១៩៤៨"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើទសពិធរាជធម៌មានចំនួនប៉ុន្មានប្រការ? អ្វីខ្លះ?",
    "options": [
      "១០ប្រការ គឺ ទាន សីល បរិច្ចាគ អាជ្ជវៈ មទ្ទវៈ តបៈ អក្កោធៈ អវិហឹសា ខន្តី និងអវិរោធនៈ",
      "១០ប្រការ គឺ ធម៌សីល បរិច្ចាគ អាជ្ជវៈ មទ្ទវៈ តបៈ អក្កោធៈ អវិហឹសា ខន្តី និងអវិរោធនៈ",
      "១០ប្រការ គឺ ទាន សីល បរិច្ចាគ អាជ្ជវៈ មទ្ទវៈ តបៈ អក្កោធៈ អវិហឹសា ខន្តី និងធម៌",
      "១០ប្រការ គឺ ទាន សីល បរិច្ចាគ អាជ្ជវៈ មទ្ទវៈ តបៈ អក្កោធៈ អវិហឹសា ធម៌ និងអវិរោធនៈ"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសកម្ពុជាមានព្រំប្រទល់ខាងជើងជាប់នឹងប្រទេសណា?",
    "options": [
      "ភូមា",
      "ថៃ",
      "ឡាវ",
      "វៀតណាម"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសណាដែលមានប្រជាជនច្រើនជាងគេនៅលើពិភពលោក?",
    "options": [
      "ប្រទេសចិន",
      "ប្រទេសរុស្ស៊ី",
      "ប្រទេសអាមេរិក",
      "ប្រទេសឥណ្ឌា"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើបច្ចុប្បន្ន ប្រទេសកម្ពុជាមានប៉ុន្មានរាជធានីខេត្ត?",
    "options": [
      "២៤ រាជធានី ខេត្ត",
      "២៥ ខេត្ត រាជធានី",
      "២៥ រាជធានី ខេត្ត",
      "២៤ ខេត្ត រាជធានី"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើផ្លូវថ្នល់ប្រទេសកម្ពុជាចែកចេញជាប៉ុន្មាន?",
    "options": [
      "៥",
      "៣",
      "៤",
      "២"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើព្រែកជីកហ្វូណនតេជោបើកការដ្ឋានសាងសង់នៅថ្ងៃខែឆ្នាំណា?",
    "options": [
      "៥ សីហា ២០២២",
      "៥ សីហា ២០២៥",
      "៥ សីហា ២០២៣",
      "៥ សីហា ២០២៤"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសណាដែលមានប្រជាជនតិចជាងគេនៅតំបន់អាស៊ីអាគ្នេយ៍?",
    "options": [
      "ប្រទេសប៊្រុយណេ",
      "ប្រទេសថៃ",
      "ប្រទេសកម្ពុជា",
      "ប្រទេសសិង្ហបុរី"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើសមាគមប្រជាជាតិអាស៊ីអាគ្នេយ៍ហៅកាត់អាស៊ាន ត្រូវបានបង្កើតឡើងតាមរយៈសេចក្តីប្រកាសទីក្រុងបាងកក នៅថ្ងៃខែឆ្នាំណា?",
    "options": [
      "៧ សីហា ១៩៦៧",
      "៨ សីហា ១៩៦៧",
      "៩ សីហា ១៩៦៧",
      "៦ សីហា ១៩៦៧"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសកម្ពុជាមានព្រំប្រទល់ខាងកើតជាប់នឹងប្រទេសណា?",
    "options": [
      "ភូមា",
      "ថៃ",
      "ឡាវ",
      "វៀតណាម"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើព្រែកជីកហ្វូណនតេជោមានប្រវែងសរុបប៉ុន្មាន?",
    "options": [
      "សរុប១៩០ គីឡូម៉ែត្រ",
      "សរុប១៧០ គីឡូម៉ែត្រ",
      "សរុប១៨០ គីឡូម៉ែត្រ",
      "សរុប១៦០០ គីឡូម៉ែត្រ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើទង់សាសនាព្រះពុទ្ធមានប៉ុន្មានពណ៌?",
    "options": [
      "៤",
      "៥",
      "៦",
      "៧"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសណាដែលមានប្រជាជនស្លាប់ច្រើនដោយសារ កូវីដ-១៩ ច្រើនជាងគេ?",
    "options": [
      "រុស្ស៊ី",
      "ជប៉ុន",
      "ចិន",
      "អាមេរិក"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "ប្រទេសសមាជិក ASEAN បានចុះហត្ថលេខាលើកិច្ចព្រមព្រៀងស្តីពីការបង្កើតលេខាធិការដ្ឋានអាស៊ាននៅទីក្រុងបាលី ប្រទេសឥណ្ឌូនេស៊ី នៅថ្ងៃខែឆ្នាំណា?",
    "options": [
      "២០ កុម្ភៈ ១៩៧៦",
      "២៣ កុម្ភៈ ១៩៧៦",
      "២៤ កុម្ភៈ ១៩៧៦",
      "២២ កុម្ភៈ ១៩៧៦"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "ចលនារបស់ផែនដីវិលជុំវិញព្រះអាទិត្យបង្កើតបានជាអ្វី?",
    "options": [
      "រង្វិលជុំ",
      "រង្វិលខ្ញាល់",
      "",
      ""
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើទន្លេមេគង្គមានប្រវែងសរុបប៉ុន្មាន?",
    "options": [
      "៣២០០ គីឡូម៉ែត្រ",
      "៤២០០ គីឡូម៉ែត្រ",
      "៤៣០០ គីឡូម៉ែត្រ",
      "៣៤០០ គីឡូម៉ែត្រ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើទន្លេមេគង្គហូរកាត់ប្រទេសកម្ពុជាចំនួនប៉ុន្មានខេត្ត?",
    "options": [
      "៥",
      "៤",
      "៦",
      "៧"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើបាវចនាអាស៊ានគឺជាអ្វី?",
    "options": [
      "អាស៊ានតែមួយ អត្តសញ្ញាណតែមួយ និងសហគមន៍តែមួយ",
      "ចក្ខុវិស័យតែមួយ អត្តសញ្ញាណតែមួយ និងអាស៊ានតែមួយ",
      "ចក្ខុវិស័យតែមួយ អត្តសញ្ញាណតែមួយ និងសហគមន៍តែមួយ",
      "ចក្ខុវិស័យតែមួយ ប្រទេសអាស៊ានតែមួយ និងសហគមន៍តែមួយ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើពុទ្ធសករាជចាប់រាប់ពីពេលណាមក?",
    "options": [
      "ចាប់ពីពេលព្រះពុទ្ធចូលបរិនិព្វាន",
      "ចាប់ពីពេលព្រះពុទ្ធត្រាស់ដឹង",
      "ចាប់ពីពេលព្រះពុទ្ធចាប់បដិសន្ធិ",
      ""
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើទន្លេមេគង្គហូរកាត់ប្រទេសណាខ្លះ?",
    "options": [
      "ចិន ឡាវ ថៃ កម្ពុជា វៀតណាម",
      "ចិន ភូមា ឡាវ ថៃ កម្ពុជា វៀតណាម",
      "ចិន ភូមា ឡាវ កម្ពុជា វៀតណាម",
      "ចិន ភូមា ឡាវ ថៃ កម្ពុជា"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសកម្ពុជាទទួលបានសន្តិភាពពេញលេញនៅក្នុងឆ្នាំណា?",
    "options": [
      "ឆ្នាំ១៩៩៧",
      "ឆ្នាំ១៩៩៨",
      "ឆ្នាំ១៩៩៣",
      "ឆ្នាំ១៩៩៥"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសកម្ពុជាចូលជាសមាជិកអាស៊ាននៅថ្ងៃខែឆ្នាំណា?",
    "options": [
      "៣០ មេសា ១៩៩៩",
      "២០ មេសា ១៩៩៩",
      "២៩ មេសា ១៩៩៩",
      "៣១ មេសា ១៩៩៩"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើផ្ទៃដីមួយហិកតា ស្មើនឹងប៉ុន្មាន?",
    "options": [
      "១០០ ០០០ ម៉ែត្រការ៉េ",
      "១០០ ម៉ែត្រការ៉េ",
      "១ ០០០ ម៉ែត្រការ៉េ",
      "១០ ០០០ ម៉ែត្រការ៉េ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "អង្គការសហប្រជាជាតិបង្កើតឡើងនៅថ្ងៃខែឆ្នាំ ៖",
    "options": [
      "២៥ តុលា ១៩៤៥",
      "២៤ តុលា ១៩៤៥",
      "២៤ តុលា ១៩៤៩",
      "២៥ តុលា ១៩៤៩"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "ព្រះរាជាណាចក្រកម្ពុជាទី២ គិតចាប់ពីឆ្នាំ ៖",
    "options": [
      "ឆ្នាំ១៩៩៣ - បច្ចុប្បន្ន",
      "ឆ្នាំ១៩៩៤ - បច្ចុប្បន្ន",
      "ឆ្នាំ១៩៩១ - បច្ចុប្បន្ន",
      "ឆ្នាំ១៩៩២ - បច្ចុប្បន្ន"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "គណៈកម្មាធិការអន្តរជាតិកាកបាទក្រហមទទួលស្គាល់ កាកបាទក្រហមកម្ពុជានៅថ្ងៃខែឆ្នាំ ៖",
    "options": [
      "៦ តុលា ១៩៦០",
      "៦ តុលា ១៩៦២",
      "៦ តុលា ១៩៦៨",
      "៦ តុលា ១៩៦៦"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "សន្ធិសញ្ញាសន្តិភាពទីក្រុងប៉ារីសធ្វើឡើងនៅថ្ងៃខែឆ្នាំ ៖",
    "options": [
      "២៣ តុលា ១៩៩១",
      "២៣ តុលា ១៩៩៣",
      "២៣ តុលា ១៩៩៥",
      "២៣ តុលា ១៩៩៨"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "ប្រទេសណានៅតំបន់អាស៊ីអាគ្នេយ៍ប្រទេសណាដែលមិនជាប់នឹងសមុទ្រ ៖",
    "options": [
      "កម្ពុជា",
      "ភូមា",
      "ឡាវ",
      "ឥណ្ឌូនេស៊ី"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើអាស៊ានបូក ៣ មានប្រទេសណាខ្លះ?",
    "options": [
      "មានអាស៊ាន បូក ជប៉ុន កូរ៉េខាងត្បូង អាមេរិក",
      "មានអាស៊ាន បូក អាមេរិក ជប៉ុន កូរ៉េខាងត្បូង",
      "មានអាស៊ាន បូក ចិន ជប៉ុន កូរ៉េខាងត្បូង",
      "មានអាស៊ាន បូក ចិន អាមេរិក កូរ៉េខាងត្បូង"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើរដ្ឋប្រហារទម្លាក់សម្ដេច នរោត្តម សីហនុ នៅថ្ងៃខែឆ្នាំណា?",
    "options": [
      "១៨ មីនា ១៩៧០",
      "១៨ មីនា ១៩៧៥",
      "១៨ មីនា ១៩៧៩",
      "១៨ មីនា ១៩៧៣"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើតាមចន្ទគតិមានប៉ុន្មានខែ?",
    "options": [
      "១៥",
      "១៣",
      "១០",
      "១២"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើភាសាខ្មែរស្ថិតនៅក្នុងអំបូរភាសាណាមួយ?",
    "options": [
      "អំបូរអូស្ត្រូអាស៊ី",
      "អំបូរអូស្ត្រូណេស៊ី",
      "អំបូរអូស្ត្រូឥណ្ឌូចិន",
      "អំបូរភាសាខ្មែរ-មន ឬ មន-ខ្មែរ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសណាដែលមានផ្ទៃដីធំជាងគេនៅតំបន់អាស៊ីអាគ្នេយ៍?",
    "options": [
      "ប្រទេសឥណ្ឌូនេស៊ី",
      "ប្រទេសថៃ",
      "ប្រទេសកម្ពុជា",
      "ប្រទេសវៀតណាម"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសណាដែលមានផ្ទៃដីធំជាងគេនៅលើពិភពលោក?",
    "options": [
      "ប្រទេសចិន",
      "ប្រទេសរុស្ស៊ី",
      "ប្រទេសអាមេរិក",
      "ប្រទេសជប៉ុន"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសកម្ពុជាមានព្រំប្រទល់ខាងលិចជាប់នឹងប្រទេសណា?",
    "options": [
      "ភូមា",
      "ថៃ",
      "ឡាវ",
      "វៀតណាម"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសណាខ្លះ ចាញ់សង្គ្រាមលោកលើកទី២?",
    "options": [
      "ជប៉ុន អ៊ីតាលី អាល្លឺម៉ង់",
      "ជប៉ុន",
      "អាល្លឺម៉ង់",
      "អ៊ីតាលី អាល្លឺម៉ង់"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើប្រទេសណាដែលមានប្រជាជនច្រើនជាងគេនៅអាស៊ីអាគ្នេយ៍?",
    "options": [
      "ភូមា",
      "វៀតណាម",
      "ថៃ",
      "ឥណ្ឌូនេស៊ី"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើពិធីកាន់បិណ្ឌមានរយៈពេលប៉ុន្មានថ្ងៃ?",
    "options": [
      "១៥",
      "២៨",
      "១៤",
      "២៩"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើព្រះបាទ នរោត្តម សីហមុនី ឡើងគ្រងរាជ្យសម្បត្តិនៅថ្ងៃខែឆ្នាំណា?",
    "options": [
      "២៩ តុលា ២០០៥",
      "២៨ តុលា ២០០៤",
      "២៨ តុលា ២០០៥",
      "២៩ តុលា ២០០៤ ៤៩. តើការសម្ពោធពហុកីឡដ្ឋានមរតកតេជោនៅថ្ងៃខែឆ្នាំណា?"
    ],
    "correct": 4,
    "isActive": true
  },
  {
    "subject": "វប្បធម៌ទូទៅ",
    "question": "តើគេចែក ចម្លាក់បុរាណខ្មែរ ចេញជាប៉ុន្មានប្រភេទ?",
    "options": [
      "៥ប្រភេទ",
      "៧ប្រភេទ",
      "៣ប្រភេទ",
      ""
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "តើច្បាប់ហិរញ្ញវត្ថុមានប៉ុន្មានប្រភេទធំៗ?",
    "options": [
      "ពីរប្រភេទ",
      "មួយប្រភេទ",
      "បួនប្រភេទ",
      "បីប្រភេទ"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "តើមាតិកាថវិកាមានប៉ុន្មានចំណាត់ថ្នាក់?",
    "options": [
      "ប្រាំពីរចំណាត់ថ្នាក់",
      "ប្រាំបីចំណាត់ថ្នាក់",
      "ប្រាំមួយចំណាត់ថ្នាក់",
      "ប្រាំចំណាត់ថ្នាក់"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "សូចនាករចែកចេញជា៖",
    "options": [
      "បែបបរិមាណ",
      "បែបគុណភាព",
      "ទាំងបែបបរិមាណ និងទាំងបែបគុណភាព",
      "ចម្លើយត្រឹមត្រូវទាំងអស់"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "តើវដ្តថវិកាមានប៉ុន្មានដំណាក់កាល?",
    "options": [
      "ពីរដំណាក់កាល",
      "បីដំណាក់កាល",
      "បួនដំណាក់កាល",
      "មិនត្រូវទាំងអស់"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "តាមមាត្រា ១១ នៃច្បាប់ស្តីពីហិរញ្ញវត្ថុសាធារណៈ តើកាលបរិច្ឆេទនៃឆ្នាំថវិកាមានរយៈពេលប៉ុន្មាន?",
    "options": [
      "បីខែ",
      "ប្រាំបួនខែ",
      "ដប់ពីរខែ",
      "ប្រាំមួយខែ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "ដូចម្តេចដែលហៅថាសូចនាករ?",
    "options": [
      "ជាចំណុចចាប់ផ្តើមនៃផែនការសកម្មភាព",
      "ជារង្វាស់ដែលវាស់លើលទ្ធផល ឬសមិទ្ធកម្មនៃកម្មវិធី អនុកម្មវិធី ឬចង្កោមសកម្មភាព",
      "ជាគោលដៅនៃផែនការសកម្មភាព",
      "ចម្លើយត្រឹមត្រូវទាំងអស់"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "តាមគោលការណ៍ណែនាំស្តីពីការរៀបចំថវិកាកម្មវិធី ការរៀបចំថវិកាកម្មវិធីត្រូវរៀបចំ ៖",
    "options": [
      "កំណត់សូចនាករ និងកំណត់គោលដៅសូចនាករ",
      "កំណត់រចនាសម្ព័ន្ធកម្មវិធី",
      "កំណត់គោលបំណងគោលនយោបាយ",
      "កំណត់គោលបំណងគោលនយោបាយ កំណត់រចនាសម្ព័ន្ធកម្មវិធី និងកំណត់សូចនាករ និងកំណត់គោលដៅសូចនាករ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "អាណាប័កជាអ្វី?",
    "options": [
      "ប្រធានអង្គភាព",
      "ថ្នាក់ដឹកនាំក្រសួងស្ថាប័ន",
      "អ្នកបញ្ជាចំណូល ចំណាយតាមក្រសួងស្ថាប័ន និងអង្គភាព",
      "ចម្លើយត្រឹមត្រូវទាំងអស់"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "ថ្លៃចំណាយសរុបរបស់កម្មវិធីមួយស្មើនឹង៖",
    "options": [
      "ចំណាយមូលធនសរុប",
      "ចំណាយចរន្តសរុប",
      "ចំណាយសរុបទាំងចរន្ត និងទាំងមូលធន",
      "ចម្លើយសុទ្ធតែមិនត្រឹមត្រូវ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "កត្តាជំរុញថ្លៃរួមមាន៖",
    "options": [
      "ការប្រែប្រួលនៃប្រជាសាស្ត្រ",
      "ការប្រែប្រួលនៃសេដ្ឋកិច្ច និងសង្គម",
      "ការរីកចម្រើននៃបច្ចេកវិទ្យា",
      "ការប្រែប្រួលនៃប្រជាសាស្ត្រ ការប្រែប្រួលនៃសេដ្ឋកិច្ច និងសង្គម និងការរីកចម្រើននៃបច្ចេកវិទ្យា"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "អាណាប័កចែកជា៖",
    "options": [
      "មួយប្រភេទ",
      "ពីរប្រភេទ",
      "បីប្រភេទ",
      "ចម្លើយត្រឹមត្រូវទាំងអស់"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "ការគ្រោងចំណាយថវិកាចរន្តក្នុងផែនការយុទ្ធសាស្ត្រថវិការួមមាន៖",
    "options": [
      "ក្រៅបន្ទុកបុគ្គលិក",
      "បន្ទុកបុគ្គលិក និងក្រៅបន្ទុកបុគ្គលិក",
      "បន្ទុកបុគ្គលិក",
      "ចម្លើយត្រឹមត្រូវទាំងអស់"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "សូចនាករចែកចេញជា៖",
    "options": [
      "សូចនាករលទ្ធផលក្នុងឆ្នាំ",
      "សូចនាករលទ្ធផលចុងក្រោយ",
      "សូចនាករលទ្ធផលក្នុងឆ្នាំ និងសូចនាករលទ្ធផលចុងក្រោយ",
      "ចម្លើយទាំងបីផ្សេងទៀតសុទ្ធតែត្រឹមត្រូវ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "នៅក្នុងសេចក្តីផ្តើមនៃការរៀបចំផែនការយុទ្ធសាស្ត្រថវិការួមមានចំណុច សំខាន់ៗប៉ុន្មាន?",
    "options": [
      "បីចំណុច",
      "បួនចំណុច",
      "ពីរចំណុច",
      "ច្រើនចំណុច"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "អត្ថប្រយោជន៍ថវិកាកម្មវិធី៖",
    "options": [
      "បង្កើតឱ្យមានបន្ទាត់គណនេយ្យភាពផ្ទៃក្នុងក្រសួងស្ថាប័ន",
      "ជួយផ្សារភ្ជាប់ថវិកាទៅនឹងគោលនយោបាយអាទិភាពរបស់ក្រសួងស្ថាប័ន",
      "ផ្លាស់ប្តូរពីការយកចិត្តទុកដាក់លើធាតុចូលទៅជាការផ្តោតទៅលើលទ្ធផល ឬសមិទ្ធកម្មក្នុងការអនុវត្តគោលនយោបាយរបស់រាជរដ្ឋាភិបាល",
      "ជួយផ្សារភ្ជាប់ថវិកាទៅនឹងគោលនយោបាយអាទិភាពរបស់ក្រសួងស្ថាប័ន និងបង្កើតឱ្យមានបន្ទាត់គណនេយ្យភាពផ្ទៃក្នុងក្រសួងស្ថាប័ន ព្រមទាំងផ្លាស់ប្តូរពីការយកចិត្តទុកដាក់តែលើធាតុចូលទៅជាការផ្តោតទៅលើលទ្ធផល ឬសមិទ្ធកម្មក្នុង ការអនុវត្តគោលនយោបាយរបស់រាជរដ្ឋាភិបាល"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "និយមន័យថវិកាតាមភាពជាក់ស្តែង៖",
    "options": [
      "ឧបករណ៍បម្រើឱ្យគោលនយោបាយ",
      "សំណុំនៃគណនេយ្យដែលព័ត៌មានសម្រាប់ឆ្នាំនីមួយៗ អំពីធនធានអចិន្ត្រៃយ៍ និងបន្ទុកអចិន្ត្រៃយ៍ ទាំងអស់របស់រដ្ឋ ឬរបស់ស្ថាប័ន ឬរបស់អង្គភាពណាមួយ",
      "ប្រាក់ដែលប្រជាពលរដ្ឋត្រូវការ",
      "ប្រាក់ខែរបស់មន្ត្រីរាជការ"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "វិធីសាស្ត្រគណនេយ្យប្រយោលរួមមាន៖",
    "options": [
      "វិធីសាស្ត្រពីក្រោមឡើងលើ",
      "វិធីសាស្ត្រពីលើចុះក្រោម និងវិធីសាស្ត្រពីក្រោមឡើងលើ",
      "វិធីបូកសរុបទាំងអស់",
      "វិធីសាស្ត្រពីលើចុះក្រោម"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "ចូរកំណត់និយមន័យថវិកាកម្មវិធី៖",
    "options": [
      "ជាការរៀបចំតាមការស្នើសុំរបស់ក្រសួងស្ថាប័ន",
      "ជាការរៀបចំថវិកាតាមតម្រូវការជាក់ស្តែងរបស់ក្រសួងស្ថាប័ន",
      "ជាប្រព័ន្ធនៃការរៀបចំថវិកាដោយផ្តោតលើធាតុចូលជាសំខាន់",
      "ជាប្រព័ន្ធនៃការរៀបចំដោយផ្អែកលើការកំណត់កម្មវិធីច្បាស់លាស់ដែលគាំទ្រគោលបំណង គោលនយោបាយរបស់ក្រសួងស្ថាប័ន ដោយឆ្លុះបញ្ចាំងពីសូចនាករ គោលដៅសូចនាករ និងបញ្ជាក់ពីធនធានដែលត្រូវការ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "តើការរៀបចំថវិកាមានប៉ុន្មានដំណាក់កាល?",
    "options": [
      "បីដំណាក់កាល",
      "ពីរដំណាក់កាល",
      "បួនដំណាក់កាល",
      "ចម្លើយត្រឹមត្រូវទាំងអស់"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "ហិរញ្ញវត្ថុសាធារណៈ (ថវិកាកម្មវិធី)",
    "question": "សម្រាប់ការងាររៀបចំថវិកាគេបែងចែកចេញជាវិស័យ៖",
    "options": [
      "ពីរវិស័យ",
      "បីវិស័យ",
      "បួនវិស័យ",
      "ច្រើនវិស័យ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើទីស្ដីការគណៈរដ្ឋមន្រ្តីគឺជាអ្វី?",
    "options": [
      "រាជរដ្ឋាភិបាលកម្ពុជា",
      "ប្រមុខរាជរដ្ឋាភិបាលកម្ពុជា",
      "សេនាធិការរបស់រាជរដ្ឋាភិបាលសម្រាប់សម្របសម្រួលការងារប្រចាំថ្ងៃ របស់គណៈរដ្ឋមន្រ្តី",
      "គណៈរដ្ឋមន្រ្តី"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ព្រះរាជក្រម និងព្រះរាជក្រឹត្យ ត្រូវ ៖",
    "options": [
      "ឡាយព្រះហស្តលេខាដោយព្រះមហាក្សត្រ",
      "ឡាយព្រះហស្តលេខាដោយព្រះមហាក្សត្រដែលជាប្រមុខរដ្ឋ",
      "ឡាយព្រះហស្តលេខាដោយព្រះមហាក្សត្រដែលជាប្រមុខរដ្ឋ ឬហត្ថលេខាដោយប្រមុខរដ្ឋស្ដីទី",
      "ចម្លើយទាំងបីខាងលើ សុទ្ធតែមិនត្រឹមត្រូវ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើព្រឹទ្ធសភានៃព្រះរាជាណាចក្រកម្ពុជាមានអាណត្តិប៉ុន្មានឆ្នាំ?",
    "options": [
      "៤ឆ្នាំ",
      "៥ឆ្នាំ",
      "៦ឆ្នាំ",
      "អាណត្តិស្មើនឹងអាណត្តិរបស់រាជរដ្ឋាភិបាល"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើមួយណាជាព្រះរាជក្រឹត្យមានលក្ខណៈឯកត្តភូត?",
    "options": [
      "ព្រះរាជក្រឹត្យស្ដីពីការរៀបចំនិងការប្រព្រឹត្តទៅរបស់សាលាភូមិន្ទរដ្ឋបាល",
      "ព្រះរាជក្រឹត្យស្ដីពីការតែងតាំងមន្រ្តីរាជការ",
      "ព្រះរាជក្រឹត្យស្ដីពីគោលការណ៍រួមនៃមុខងារសាធារណៈរបស់រដ្ឋ",
      "ចម្លើយទាំងបីខាងលើ សុទ្ធតែត្រឹមត្រូវ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើក្រុមប្រឹក្សានៃរដ្ឋបាលថ្នាក់ក្រោមជាតិមានអាណត្តិប៉ុន្មានឆ្នាំ?",
    "options": [
      "៤ឆ្នាំ",
      "៥ឆ្នាំ",
      "៦ឆ្នាំ",
      "គ្មានចម្លើយត្រឹមត្រូវ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើក្រុមប្រឹក្សារាជធានីខេត្ត ក្រុង ស្រុក ខណ្ឌ កើតឡើងតាមរយៈ ៖",
    "options": [
      "ការបោះឆ្នោតជាសកល",
      "ការបោះឆ្នោតជាអសកល",
      "ចម្លើយ ក និង ខ សុទ្ធតែត្រឹមត្រូវ",
      "គ្មានចម្លើយត្រឹមត្រូវ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើការដាក់ចេញនូវដីកាតែងតាំង ឬបញ្ចប់មុខតំណែងបុគ្គលិករដ្ឋបាលថ្នាក់ក្រោមជាតិ ត្រូវកំណត់ដោយ ៖",
    "options": [
      "ដីការបស់សាលាដំបូងរាជធានី ខេត្ត",
      "ដីការបស់ក្រុមប្រឹក្សារាជធានី ខេត្ត",
      "ដីការបស់អភិបាលនៃគណៈអភិបាលរាជធានី ខេត្ត",
      "ចម្លើយ ខ និង គ សុទ្ធតែត្រឹមត្រូវ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "រដ្ឋមន្រ្តីក្រសួង ស្ថាប័នមានសិទ្ធិដាក់ចេញ៖",
    "options": [
      "ប្រកាស និងសេចក្ដីសម្រេច",
      "ប្រកាស សេចក្ដីសម្រេច និងសារាចរណែនាំ",
      "ប្រកាស",
      "ប្រកាស សេចក្ដីសម្រេច ដីកា និងសារាចរណែនាំ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "អនុប្រធាននាយកដ្ឋានត្រូវតែងតាំងដោយ៖",
    "options": [
      "ព្រះមហាក្សត្រ",
      "នាយករដ្ឋមន្រ្តី",
      "រដ្ឋមន្រ្តីក្រសួង ស្ថាប័ន",
      "អគ្គនាយកនៃអគ្គនាយកដ្ឋាន"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើអគ្គនាយករងនៃអគ្គនាយកដ្ឋានរបស់ក្រសួង ស្ថាប័នត្រូវតែងតាំងដោយអ្វី?",
    "options": [
      "ព្រះរាជក្រឹត្យ",
      "អនុក្រឹត្យ",
      "ប្រកាស",
      "ដីកា"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើសមាសភាពរបស់រាជរដ្ឋាភិបាលចាប់ពីអាណត្តិទី៦ មកមានអ្វីខ្លះ?",
    "options": [
      "នាយករដ្ឋមន្រ្តី ឧបនាយករដ្ឋមន្ត្រី ទេសរដ្ឋមន្ត្រី",
      "នាយករដ្ឋមន្រ្តី ឧបនាយករដ្ឋមន្ត្រី ទេសរដ្ឋមន្ត្រី រដ្ឋមន្រ្តី",
      "នាយករដ្ឋមន្រ្តី ឧបនាយករដ្ឋមន្ត្រី ទេសរដ្ឋមន្ត្រី រដ្ឋមន្រ្តី រដ្ឋលេខាធិការ",
      "នាយករដ្ឋមន្រ្តី ឧបនាយករដ្ឋមន្ត្រី ទេសរដ្ឋមន្ត្រី រដ្ឋមន្រ្តី រដ្ឋលេខាធិការ អនុរដ្ឋលេខាធិការ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើក្រុមប្រឹក្សាឃុំ សង្កាត់ មានសមាសភាពប៉ុន្មានរូប?",
    "options": [
      "៥រូប ដល់ ៦រូប",
      "៥រូប ដល់ ៧រូប",
      "៥រូប ដល់ ៩រូប",
      "៥រូប ដល់ ១១រូប"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើចាប់ពីអាណត្តិទី ៦ មក រដ្ឋសភាមានសមាជិកប៉ុន្មានរូប ?",
    "options": [
      "១២០រូប",
      "១២១រូប",
      "១២៣រូប",
      "១២៥រូប"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើសេចក្ដីព្រាងច្បាប់មានប្រភពបឋមពីណា?",
    "options": [
      "រដ្ឋសភា",
      "ព្រឹទ្ធសភា",
      "ទីស្ដីការគណៈរដ្ឋមន្រ្តី",
      "អង្គភាពជំនាញ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើច្បាប់ប្រភេទណាដែលត្រូវឆ្លងកាត់ក្រុមប្រឹក្សាធម្មនុញ្ញ?",
    "options": [
      "ច្បាប់តាមវិស័យ",
      "ច្បាប់ស្ដីពីវិសោធនកម្ម",
      "ច្បាប់រៀបចំអង្គការ",
      "ចម្លើយទាំងបីខាងលើសុទ្ធតែត្រឹមត្រូវ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើរដ្ឋសភាមានអនុប្រធានប៉ុន្មានរូប?",
    "options": [
      "១រូប",
      "២រូប",
      "៤រូប",
      "១០រូប"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើប្រព័ន្ធវិសហមជ្ឈការមានន័យដូចម្ដេច?",
    "options": [
      "ការប្រមូលផ្ដុំអំណាច",
      "ការផ្ទេរអំណាចនិងធនធានឱ្យទៅថ្នាក់ក្រោម",
      "ការប្រគល់ភាពជាតំណាងនូវអំណាចនិងធនធានឱ្យទៅថ្នាក់ក្រោម",
      "ចម្លើយខាងលើសុទ្ធតែត្រឹមត្រូវ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើក្រុមប្រឹក្សាធម្មនុញ្ញមានសមាសភាពប៉ុន្មានរូប?",
    "options": [
      "៦រូប",
      "៨រូប",
      "៩រូប",
      "១០រូប"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើប្រជាពលរដ្ឋកម្ពុជាដែលមានសិទ្ធិបោះឆ្នោតត្រូវមានអាយុយ៉ាងតិចប៉ុន្មាន?",
    "options": [
      "១៥ឆ្នាំ",
      "១៦ឆ្នាំ",
      "១៧ឆ្នាំ",
      "១៨ឆ្នាំ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើរដ្ឋបាលថ្នាក់ក្រោមជាតិបែងចែកជាអ្វីខ្លះ?",
    "options": [
      "រាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ",
      "រាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ ឃុំ សង្កាត់",
      "រាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ ឃុំ សង្កាត់ ភូមិ",
      "រាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ ឃុំ សង្កាត់ ភូមិ មណ្ឌល"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើក្រុមប្រឹក្សារាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ ត្រូវបានបោះឆ្នោតដោយនរណា?",
    "options": [
      "ប្រជាពលរដ្ឋក្នុងមូលដ្ឋាន",
      "សមាជិកក្រុមប្រឹក្សាឃុំ សង្កាត់ក្នុងអាណត្តិ",
      "ក្រុមប្រឹក្សាឃុំ សង្កាត់ និងមេភូមិ",
      "ចម្លើយខាងលើសុទ្ធតែត្រឹមត្រូវ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើព្រឹទ្ធសភាមានអនុប្រធានប៉ុន្មានរូប?",
    "options": [
      "១រូប",
      "៣រូប",
      "២រូប",
      "៥រូប"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើក្រុមប្រឹក្សាភិបាលនៃគ្រឹះស្ថានសាធារណៈរដ្ឋបាលមានសមាជិកប៉ុន្មានរូប?",
    "options": [
      "៥រូប ដល់ ៧រូប",
      "៥រូប ដល់ ៩រូប",
      "៥រូប ដល់ ៩រូប យ៉ាងច្រើន ១១រូប",
      "៦រូប ដល់ ១១រូប"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "យោងតាមច្បាប់ស្ដីពីការគ្រប់គ្រងរដ្ឋបាលរាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ (២០០៨) តើស្រុកត្រូវបែងចែកជាអ្វី?",
    "options": [
      "ឃុំ",
      "សង្កាត់",
      "ឃុំ សង្កាត់",
      "ក្រុង"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "រដ្ឋបាលថ្នាក់ក្រោមជាតិត្រូវដឹកនាំតាមគោលការណ៍អ្វី?",
    "options": [
      "វិមជ្ឈការ",
      "វិសហមជ្ឈការ",
      "វិមជ្ឈការ និងវិសហមជ្ឈការ",
      "រដ្ឋបាលឯកភាព"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើគណៈអភិបាលនៃរដ្ឋបាលថ្នាក់ក្រោមជាតិសំដៅលើអ្វី?",
    "options": [
      "ក្រុមប្រឹក្សានៃរដ្ឋបាលថ្នាក់ក្រោមជាតិ",
      "អភិបាល",
      "អភិបាលរង",
      "អភិបាល និងអភិបាលរងទាំងអស់"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើក្រុមប្រឹក្សាខេត្តមានសមាសភាពប៉ុន្មានរូប?",
    "options": [
      "៥រូប ដល់ ១១រូប",
      "១១រូប ដល់ ២១រូប",
      "១៥រូប ដល់ ២៧រូប",
      "៥រូប ដល់ ៩រូប"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ក្រុមប្រឹក្សានៃរដ្ឋបាលថ្នាក់ក្រោមជាតិមានសិទ្ធិអំណាចអ្វីខ្លះ?",
    "options": [
      "សិទ្ធិអំណាចខាងបញ្ញត្តិ និងខាងប្រតិបត្តិ",
      "សិទ្ធិអំណាចខាងបញ្ញត្តិ",
      "សិទ្ធិអំណាចខាងប្រតិបត្តិ",
      "ឆន្ទានុសិទ្ធិ"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ក្រោយឆ្នាំ២០១៩ តើការិយាល័យជំនាញថ្នាក់ក្រុង ស្រុក ខណ្ឌនៃក្រសួង ស្ថាប័នថ្នាក់ជាតិ ត្រូវស្ថិតក្រោមរចនាសម្ព័ន្ធរបស់អង្គភាពណា?",
    "options": [
      "ក្រសួង ស្ថាប័នថ្នាក់ជាតិ",
      "រដ្ឋបាលរាជធានី ខេត្ត",
      "រដ្ឋបាលក្រុង ស្រុក ខណ្ឌ",
      "ទីស្ដីការគណៈរដ្ឋមន្រ្តី"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តើប្រមុខរដ្ឋស្ដីទីជានរណា?",
    "options": [
      "ប្រធានរដ្ឋសភា",
      "ប្រធានព្រឹទ្ធសភា",
      "នាយករដ្ឋមន្ត្រី",
      "រដ្ឋមន្ត្រីក្រសួងព្រះបរមរាជវាំង"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "រាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ ត្រូវគ្រប់គ្រងតាមគោលការណ៍នៃរដ្ឋបាលឯកភាព តាមរយៈនយោបាយ ៖",
    "options": [
      "មជ្ឈការ",
      "វិមជ្ឈការ",
      "មជ្ឈការ និងវិសហមជ្ឈការ",
      "វិមជ្ឈការ និងវិសហមជ្ឈការ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ការបង្កើត ការលុបចោល ការកែប្រែព្រំប្រទល់ និងការកំណត់ឈ្មោះខេត្ត ត្រូវសម្រេចដោយ៖",
    "options": [
      "អនុក្រឹត្យ",
      "ដីកា",
      "ព្រះរាជក្រម",
      "ព្រះរាជក្រឹត្យ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ការបង្កើត ការលុបចោល ការកែប្រែព្រំប្រទល់ និងការកំណត់ឈ្មោះក្រុង ស្រុក ខណ្ឌ ត្រូវសម្រេចដោយ៖",
    "options": [
      "អនុក្រឹត្យ",
      "ដីកា",
      "ព្រះរាជក្រម",
      "ព្រះរាជក្រឹត្យ"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ក្រុមប្រឹក្សារាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ ត្រូវជ្រើសរើសដោយ៖",
    "options": [
      "ប្រជាពលរដ្ឋ",
      "សមាជិកក្រុមប្រឹក្សាឃុំ សង្កាត់",
      "សមាជិករដ្ឋសភា",
      "មេភូមិ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ក្រុមប្រឹក្សារាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ មានអាណត្តិចំនួន៖",
    "options": [
      "៤ឆ្នាំ",
      "៥ឆ្នាំ",
      "៦ឆ្នាំ",
      "៧ឆ្នាំ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "វិធានខាងផ្លូវច្បាប់ដែលបានអនុម័តដោយក្រុមប្រឹក្សាគឺ៖",
    "options": [
      "សេចក្តីសម្រេច",
      "ដីកា",
      "ប្រកាស",
      "សេចក្តីជូនដំណឹង"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "អភិបាលរាជធានី ខេត្ត ត្រូវតែងតាំងដោយ៖",
    "options": [
      "ប្រកាស",
      "អនុក្រឹត្យ",
      "ដីកា",
      "ព្រះរាជក្រឹត្យ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "អភិបាលរងរាជធានី អភិបាលរងខេត្ត អភិបាលក្រុង អភិបាលស្រុក អភិបាលខណ្ឌ ត្រូវតែងតាំងដោយ៖",
    "options": [
      "ប្រកាស",
      "អនុក្រឹត្យ",
      "ដីកា",
      "ព្រះរាជក្រឹត្យ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "អភិបាលរងក្រុង អភិបាលរងស្រុក អភិបាលរងខណ្ឌ ត្រូវតែងតាំងដោយ៖",
    "options": [
      "ប្រកាស",
      "អនុក្រឹត្យ",
      "ដីកា",
      "ព្រះរាជក្រឹត្យ"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "នាយករដ្ឋបាលត្រូវធ្វើសេចក្តីរាយការណ៍ និងគណនេយ្យភាពចំពោះ៖",
    "options": [
      "ក្រុមប្រឹក្សា",
      "ក្រុមប្រឹក្សា និងគណៈអភិបាល",
      "គណៈអភិបាល",
      "ប្រជាពលរដ្ឋ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ទិសដៅវិមជ្ឈការ និងការគ្រប់គ្រងរដ្ឋបាលឃុំ សង្កាត់ គឺ៖",
    "options": [
      "ផ្តល់ឱកាសដល់ប្រជាពលរដ្ឋឱ្យចូលរួមកាន់តែទូលំទូលាយនៅក្នុងការធ្វើសេចក្តីសម្រេចចិត្តដែលមានផលប៉ះពាល់ទៅលើជីវភាពរស់នៅ និងអនាគតរបស់ខ្លួន",
      "លើកកម្ពស់លទ្ធិប្រជាធិបតេយ្យ អភិបាលកិច្ចល្អ និងគុណភាពនៃជីវភាពរស់នៅ",
      "ចម្លើយត្រូវទាំងអស់",
      "ធានាការអភិវឌ្ឍប្រកបដោយចីរភាពរួមទាំងការផ្តល់សេវាជាមូលដ្ឋានផងដែរ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ក្រុមប្រឹក្សាឃុំ សង្កាត់ ត្រូវជ្រើសរើសឡើងតាមការបោះឆ្នោតដោយ៖",
    "options": [
      "មេភូមិ",
      "ប្រជាពលរដ្ឋ",
      "ស្មៀន",
      "គ្មានចម្លើយ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ក្រុមប្រឹក្សាឃុំ សង្កាត់ មានអាណត្តិចំនួន៖",
    "options": [
      "៤ឆ្នាំ",
      "៥ឆ្នាំ",
      "៦ឆ្នាំ",
      "៧ឆ្នាំ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "តួនាទី និងសិទ្ធិអំណាចរបស់ក្រុមប្រឹក្សារាជធានី ខេត្ត ក្រុង ស្រុក ខណ្ឌ៖",
    "options": [
      "ជាតំណាងរាជរដ្ឋាភិបាល ដែលធានាការអនុវត្តច្បាប់ និងនយោបាយក្នុងដែនសមត្ថកិច្ចរបស់ខ្លួន",
      "ជាតំណាងក្រសួងស្ថាប័នដែលទទួលខុសត្រូវក្នុងការគ្រប់គ្រងកិច្ចការតាមវិស័យ",
      "ជាតំណាងប្រជាពលរដ្ឋ ដែលទទួលខុសត្រូវក្នុងការគ្រប់គ្រង និងចាត់ចែងរាល់កិច្ចការនានាក្នុងដែនសមត្ថកិច្ចរបស់ខ្លួន",
      "ជាតំណាងគណបក្សនយោបាយឈ្នះឆ្នោត ដែលទទួលខុសត្រូវក្នុងការអនុវត្តនយោបាយរបស់គណបក្សរបស់ខ្លួន"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ក្នុងចំណោមអ្នកផ្តល់សេវាខាងក្រោមនេះ តើអ្នកណាជាអ្នកផ្តល់សេវាសាធារណៈ?",
    "options": [
      "អ្នកបំពេញការងារនៅតាមគ្រឹះស្ថានបណ្តុះបណ្តាលឯកជន",
      "អ្នកបំពេញការងារនៅតាមអាហារដ្ឋាន",
      "អ្នកបំពេញការងារនៅតាមមន្ទីរពេទ្យឯកជន",
      "អ្នកបំពេញការងារនៅតាមក្រសួង ស្ថាប័ន និងរដ្ឋបាលថ្នាក់ក្រោមជាតិ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ការិយាល័យច្រកចេញចូលតែមួយមានផ្នែកសំខាន់ចំនួនពីរ គឺ៖",
    "options": [
      "ផ្នែកជួរមុខ និងផ្នែកជួរក្រោយ",
      "ផ្នែកកណ្តាល និងជួរក្រោយ",
      "ផ្នែកជួរមុខ និងផ្នែកកណ្តាល",
      "ផ្នែកជួរមុខ និងផ្នែកសម្របសម្រួល"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "សេវាសាធារណៈដែលមានគុណភាពល្អ គឺជាសេវាសាធារណៈដែល៖",
    "options": [
      "មានការពេញចិត្តពីអ្នកប្រើប្រាស់សេវាសាធារណៈ",
      "មានការគាំទ្រពីដៃគូអភិវឌ្ឍ",
      "មានការពេញចិត្តពីអង្គភាពផ្តល់សេវាសាធារណៈខ្លួនឯង",
      "មិនយកថ្លៃសេវា"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "ប្រធានការិយាល័យប្រជាពលរដ្ឋ គឺជាតំណាង៖",
    "options": [
      "បុគ្គលមួយក្រុម",
      "គណៈអភិបាល",
      "អព្យាក្រឹត របស់ប្រជាពលរដ្ឋ",
      "ក្រុមប្រឹក្សា"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "សម្រាប់វាស់វែងគុណភាពសេវាសាធារណៈ រាជរដ្ឋាភិបាលបានកំណត់សូចនាករគោលចំនួន៖",
    "options": [
      "៤",
      "៥",
      "៦",
      "៧"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "រដ្ឋបាលសាធារណៈ",
    "question": "គ្រឹះស្ថានសាធារណៈរដ្ឋបាលត្រូវបានបង្កើតឡើងដោយ៖",
    "options": [
      "ព្រះរាជក្រឹត្យ",
      "ព្រះរាជក្រឹត្យ ឬអនុក្រឹត្យ",
      "អនុក្រឹត្យ",
      "អនុក្រឹត្យ ឬប្រកាស"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១ ត្រូវបានដាក់ចេញដើម្បីអនុវត្តនៅក្នុងនីតិកាលទីប៉ុន្មាននៃរដ្ឋសភា?",
    "options": [
      "នីតិកាលទី៧",
      "នីតិកាលទី៦",
      "នីតិកាលទី៥",
      "នីតិកាលទី៨"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើចក្ខុវិស័យរបស់កម្ពុជា នៅឆ្នាំ២០៥០ គឺប្រែក្លាយជាប្រទេសបែបណា?",
    "options": [
      "ប្រទេសដែលមានចំណូលមធ្យមកម្រិតទាប",
      "ប្រទេសអភិវឌ្ឍន៍តិចតួច",
      "ប្រទេសដែលមានចំណូលមធ្យមកម្រិតខ្ពស់",
      "ប្រទេសដែលមានចំណូលខ្ពស់"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើបាវចនាចំនួន ៥ នៃយុទ្ធសាស្ត្របញ្ចកោណ មានអ្វីខ្លះ?",
    "options": [
      "កំណើន, ការងារ, សមធម៌, ប្រសិទ្ធភាព និង ចីរភាព",
      "សន្តិភាព, ឯករាជ្យ, អធិបតេយ្យ, វឌ្ឍនភាព និង សម្បូរសប្បាយ",
      "មនុស្ស, ផ្លូវ, ទឹក, ភ្លើង និង បច្ចេកវិទ្យា",
      "កំណើន, ស្ថិរភាព, សន្តិសុខ, ការអភិវឌ្ឍ និង ឯករាជ្យ"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើអាទិភាពគន្លឹះចំនួន ៥ នៅក្នុងយុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១ មានអ្វីខ្លះ?",
    "options": [
      "កសិកម្ម, ទេសចរណ៍, ឧស្សាហកម្ម, ពាណិជ្ជកម្ម និង បច្ចេកវិទ្យា",
      "សាលារៀន, មន្ទីរពេទ្យ, ផ្លូវថ្នល់, ប្រឡាយទឹក និង អ៊ីនធឺណិត",
      "មនុស្ស, ផ្លូវ, ទឹក, ភ្លើង និង បច្ចេកវិទ្យា",
      "មនុស្ស, ផ្លូវ, ទឹក, ភ្លើង និង កសិកម្ម"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "ចំណុចអាទិភាពថ្មីមួយណា ដែលត្រូវបានបន្ថែមនៅក្នុងយុទ្ធសាស្ត្របញ្ចកោណ បើធៀបនឹងយុទ្ធសាស្ត្រចតុកោណ?",
    "options": [
      "មនុស្ស",
      "បច្ចេកវិទ្យា",
      "ផ្លូវ",
      "ភ្លើង"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើយុទ្ធសាស្ត្របញ្ចកោណ នឹងត្រូវអនុវត្តមានរយៈពេលប៉ុន្មានឆ្នាំ?",
    "options": [
      "១០ ឆ្នាំ",
      "១៥ ឆ្នាំ",
      "២៥ ឆ្នាំ",
      "២០ ឆ្នាំ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើស្នូលនៃយុទ្ធសាស្ត្របញ្ចកោណ គឺផ្តោតលើអ្វី?",
    "options": [
      "ការអភិវឌ្ឍវិស័យកសិកម្ម",
      "ការកែទម្រង់ និងការពង្រឹងអភិបាលកិច្ច",
      "ការកសាងហេដ្ឋារចនាសម្ព័ន្ធរូបវន្ត",
      "ការទាក់ទាញវិនិយោគបរទេស"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើគោលដៅយុទ្ធសាស្ត្រទី១ នៃយុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១ គឺធានាកំណើនសេដ្ឋ កិច្ចក្នុងរង្វង់ប៉ុន្មានភាគរយ?",
    "options": [
      "៥%",
      "៦%",
      "៨%",
      "៧%"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើគោលដៅកាត់បន្ថយភាពក្រីក្រ នៅក្នុងយុទ្ធសាស្ត្របញ្ចកោណដំណាក់កាលទី១ កំណត់ក្នុងអត្រាទាបជាងប៉ុន្មាន?",
    "options": [
      "១០%",
      "១២%",
      "១៥%",
      "១៨%"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើរាជរដ្ឋាភិបាលបានកំណត់យក « មនុស្ស » ជាគន្លឹះអាទិភាពទីប៉ុន្មានក្នុងយុទ្ធសាស្ត្របញ្ចកោណ?",
    "options": [
      "ទី៤",
      "ទី៣",
      "ទី២",
      "ទី១"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើបញ្ចកោណទី១ នៃយុទ្ធសាស្ត្របញ្ចកោណ ផ្តោតសំខាន់លើអ្វី?",
    "options": [
      "ការអភិវឌ្ឍវិស័យឯកជន",
      "ការអភិវឌ្ឍសេដ្ឋកិច្ចឌីជីថល",
      "ការអភិវឌ្ឍមូលធនមនុស្ស",
      "ការអភិវឌ្ឍហេដ្ឋារចនាសម្ព័ន្ធ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "នៅក្នុងវិស័យអប់រំ តើមុខវិជ្ជាអ្វីដែលត្រូវបានជំរុញ នៅក្នុងយុទ្ធសាស្ត្របញ្ចកោណ?",
    "options": [
      "វិទ្យាសាស្ត្រ បច្ចេកវិទ្យា វិស្វកម្ម សិល្បៈ និងគណិតវិទ្យា",
      "ភាសាបរទេស ការទូត",
      "វិទ្យាសាស្ត្រសង្គម សីលធម៌ ប្រវត្ត អក្សរសាស្ត្រ",
      "នីតិសាស្ត្រ និងរដ្ឋបាលសាធារណៈ"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើគោលដៅមួយនៃវិស័យកីឡា គឺជំរុញឱ្យយុវជនម្នាក់ ចេះកីឡាយ៉ាងតិចប៉ុន្មានប្រភេទ?",
    "options": [
      "៣ ប្រភេទ",
      "១ ប្រភេទ",
      "២ ប្រភេទ",
      "៤ ប្រភេទ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "ទាក់ទងនឹងសុខភាព តើយុទ្ធសាស្ត្របញ្ចកោណផ្តោតលើការពង្រឹងអ្វីជាចម្បង?",
    "options": [
      "ការសាងសង់មន្ទីរពេទ្យឯកជន",
      "ការនាំចូលឱសថពីបរទេស",
      "ការកាត់បន្ថយបុគ្គលិកសុខាភិបាល",
      "ការពង្រឹងគុណភាពសេវាសុខាភិបាល និងឆ្ពោះទៅការគ្របដណ្តប់សុខភាពជាសកល"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "ទាក់ទងនឹងប្រព័ន្ធគាំពារសង្គម នឹងត្រូវអភិវឌ្ឍឈរលើស្មារតីអ្វី?",
    "options": [
      "អ្នកខ្លាំងជួយអ្នកខ្សោយ",
      "ការប្រកួតប្រជែងដោយសេរី",
      "មិនបោះបង់ពលរដ្ឋណាម្នាក់",
      "ការពឹងផ្អែកលើជំនួយបរទេស"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "ក្នុងការពង្រឹងភាពជាពលរដ្ឋ តើគុណតម្លៃអ្វីខ្លះដែលត្រូវបានលើកកម្ពស់?",
    "options": [
      "សីលធម៌ សមធម៌ និងបរិយាបន្ន",
      "ការប្រកួតប្រជែង",
      "ស្មារតីជាតិនិយម",
      "ភាពជាអ្នកដឹកនាំ"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការបណ្តុះបណ្តាលជំនាញបច្ចេកទេស និងវិជ្ជាជីវៈ មានគោលបំណងអ្វី?",
    "options": [
      "ដើម្បីឱ្យមានសញ្ញាបត្រវិជ្ជាជីវៈ",
      "ដើម្បីកាត់បន្ថយចំនួនសិស្សនៅសាកលវិទ្យាល័យ",
      "ដើម្បីលើកកម្ពស់វិស័យអប់រំ",
      "ដើម្បីឆ្លើយតបនឹងតម្រូវការទីផ្សារការងារ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "ទាក់ទងនឹងកិច្ចការគាំពារសង្គម នឹងគ្របដណ្តប់លើក្រុមគោលដៅណាខ្លះជាអាទិភាព?",
    "options": [
      "ជនមានពិការភាព",
      "គ្រួសារក្រីក្រ និងក្រុមជនងាយរងគ្រោះ",
      "ស្ត្រីមេមាយ",
      "ក្មេងកំព្រា"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការលើកកម្ពស់សមភាពយេនឌ័រ ផ្តោតលើការផ្តល់ភាពអង់អាចដល់នរណា?",
    "options": [
      "បុរស និងនារី",
      "ជនចាស់ជរា",
      "ស្ត្រី និងកុមារី",
      "ជនមានពិការភាព"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើយន្តការអ្វីដែលនឹងត្រូវរៀបចំដើម្បីគាំពារសិស្ស-និស្សិតក្រីក្រ?",
    "options": [
      "ការបង្កើនអាហារូបករណ៍ និងការផ្តល់ឥណទានសម្រាប់ការសិក្សា",
      "ការផ្តល់ប្រាក់កម្ចីឱ្យសិស្ស-និស្សិត ក្នុងអត្រាការប្រាក់ទាប",
      "ការតម្រូវឱ្យបង់ថ្លៃសិក្សាជាដំណាក់កាល",
      "ការកាត់បន្ថយម៉ោងសិក្សា ដើម្បីអាចរកការងារក្រៅម៉ោង"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើបញ្ចកោណទី ២ ផ្តោតលើអ្វី?",
    "options": [
      "ការអភិវឌ្ឍធនធានមនុស្ស",
      "ការអភិវឌ្ឍវិស័យឯកជន",
      "ការអភិវឌ្ឍសេដ្ឋកិច្ចឌីជីថល",
      "ការធ្វើពិពិធកម្មសេដ្ឋកិច្ច និងការបង្កើនភាពប្រកួតប្រជែង"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "នៅក្នុងវិស័យថាមពល តើយុទ្ធសាស្ត្របញ្ចកោណលើកទឹកចិត្តលើការប្រើប្រាស់ថាមពលអ្វី?",
    "options": [
      "ថាមពលពីធ្យូងថ្ម",
      "ថាមពលស្អាត និងថាមពលកកើតឡើងវិញ",
      "ថាមពលនុយក្លេអ៊ែរ",
      "ថាមពលពីប្រេងឥន្ធនៈ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើគោលដៅផ្គត់ផ្គង់ទឹកស្អាតនៅទីប្រជុំជន ឱ្យបាន ១០០% កំណត់នៅឆ្នាំណា?",
    "options": [
      "២០៣០",
      "២០២៨",
      "២០២៥",
      "២០៥០"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើខេត្តណាដែលត្រូវបានកំណត់ជា « តំបន់សេដ្ឋកិច្ចពិសេសគំរូពហុបំណង »?",
    "options": [
      "ខេត្តសៀមរាប",
      "ខេត្តកោះកុង",
      "ខេត្តព្រះសីហនុ",
      "ខេត្តកំពត"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការអភិវឌ្ឍវិស័យដឹកជញ្ជូន និងឡូជីស្ទិក ផ្តោតលើអ្វី?",
    "options": [
      "ធ្វើផ្លូវល្បឿនលឿន",
      "បង្កើនចំនួនរថយន្តដឹកទំនិញ",
      "ធ្វើកំពង់ផែរអន្តរជាតិ",
      "ការកាត់បន្ថយថ្លៃដើម និងការតភ្ជាប់ពហុមធ្យោបាយ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "ទាក់ទងនឹងវិស័យទេសចរណ៍ តើអ្វីជាទិសដៅយុទ្ធសាស្ត្រ នៃយុទ្ធសាស្ត្របញ្ចកោណ?",
    "options": [
      "ទេសចរណ៍វប្បធម៌ និងធម្មជាតិ",
      "ទេសចរណ៍វេជ្ជសាស្ត្រ",
      "ទេសចរណ៍ល្បែងស៊ីសង",
      "ទេសចរណ៍ទិញទំនិញ"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការវិនិយោគលើ « ឧស្សាហកម្មយានយន្ត និងគ្រឿងបង្គុំអេឡិចត្រូនិក » ត្រូវបានចាត់ទុកជាអ្វី?",
    "options": [
      "ឧស្សាហកម្មសាមញ្ញ",
      "ឧស្សាហកម្មមានតម្លៃបន្ថែមខ្ពស់",
      "ឧស្សាហកម្មបុរាណ",
      "ឧស្សាហកម្មខ្នាតតូច"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើអ្វីជាគោលបំណងនៃការបង្កើត « តំបន់ពាណិជ្ជកម្មសេរីក្នុងស្រុក »?",
    "options": [
      "ដើម្បីបង្កើនការប្រមូលពន្ធ",
      "ដើម្បីកាត់បន្ថយការនាំចូល",
      "ដើម្បីជំរុញការប្រមូលផ្តុំរោងចក្រ សហគ្រាស និងលើកកម្ពស់ការនាំចេញ",
      "ដើម្បីលក់ទំនិញថោកៗ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការកែលម្អបរិយាកាសធុរកិច្ច មានគោលដៅអ្វី?",
    "options": [
      "ការពារក្រុមហ៊ុនពីការក្ស័យធន",
      "បង្កើនរបាំងពាណិជ្ជកម្ម",
      "ដើម្បីផ្ដល់ការលើកទឹកចិត្តដល់ក្រុមហ៊ុនបរទេស",
      "ទាក់ទាញការវិនិយោគ និងសម្រួលការធ្វើពាណិជ្ជកម្ម"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "នៅក្នុងវិស័យកសិកម្ម តើយុទ្ធសាស្ត្របញ្ចកោណផ្តោតលើការជំរុញអ្វី?",
    "options": [
      "ការកែច្នៃកសិផល និងកសិឧស្សាហកម្ម",
      "ការនាំចេញវត្ថុធាតុដើម",
      "ការបង្កើតផ្ទៃដីដាំដុះ",
      "ការកាត់បន្ដយការប្រើប្រាស់ជីគីមី"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើរាជរដ្ឋាភិបាលចាត់ទុកវិស័យឯកជនជាអ្វី?",
    "options": [
      "ដៃគូប្រកួតប្រជែង",
      "ម៉ាស៊ីននៃកំណើនសេដ្ឋកិច្ច",
      "ប្រភពចំណូលពន្ធរបស់រដ្ឋ",
      "ដៃគូនៃការអភិវឌ្ឍ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការអភិវឌ្ឍសហគ្រាសធុនមីក្រូ តូច និងមធ្យម (SMEs) ផ្តោតលើអ្វី?",
    "options": [
      "ការបិទអាជីវកម្មដែលមិនចុះបញ្ជី",
      "ការដកហូតការលើកទឹកចិត្ត",
      "ការផ្ទេរទៅក្នុងប្រព័ន្ធ និងការពង្រឹងសមត្ថភាព",
      "ការប្រកួតប្រជែងជាមួយក្រុមហ៊ុនបរទេស"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើយន្តការភាពជាដៃគូរវាងរដ្ឋ និងឯកជន ត្រូវបានពង្រឹងដើម្បីអ្វី?",
    "options": [
      "ដើម្បីឱ្យរដ្ឋលក់ទ្រព្យសម្បត្តិ",
      "ដើម្បីឱ្យឯកជនគ្រប់គ្រងរដ្ឋ",
      "ដើម្បីកាត់បន្ថយការទទួលខុសត្រូវរបស់រដ្ឋ",
      "ដើម្បីគាំទ្រការវិនិយោគសាធារណៈ និងការផ្តល់សេវា"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើអ្វីជាគោលដៅនៃការអភិវឌ្ឍទីផ្សារការងារ?",
    "options": [
      "ការបង្កើតការងារឱ្យបានច្រើន និងមានគុណភាព",
      "ការកាត់បន្ថយប្រាក់ឈ្នួល",
      "ការនាំពលករទៅក្រៅប្រទេសឱ្យអស់",
      "ការកាត់បន្ថយអាយុចូលនិវត្តន៍"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការលើកកម្ពស់ការប្រកួតប្រជែង មានន័យដូចម្តេច?",
    "options": [
      "ឱ្យក្រុមហ៊ុនបរទេសបោះទុនវិនិយោគក្នុងស្រុក",
      "បង្កើតបរិយាកាសធុរកិច្ចស្មើភាព និងយុត្តិធម៌",
      "ហាមឃាត់ក្រុមហ៊ុនបរទេសវិនិយោគក្នុងស្រុក",
      "កំណត់ថ្លៃទំនិញដោយរដ្ឋ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើវិស័យសេដ្ឋកិច្ចក្រៅប្រព័ន្ធ នឹងត្រូវបានដោះស្រាយយ៉ាងដូចម្តេច?",
    "options": [
      "កំណត់ឱ្យបង់ពន្ធលើប្រាក់ចំណូល",
      "កំណត់ឱ្យបង់ពន្ធលើប្រាក់ចំណេញ",
      "ជួយអភិវឌ្ឍ និងជំរុញឱ្យចូលក្នុងប្រព័ន្ធ",
      "ផាកពិន័យ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "ទាក់ទងនឹងវិស័យហិរញ្ញវត្ថុ តើអ្វីជាអាទិភាព នៅក្នុងយុទ្ធសាស្ត្របញ្ចកោណ?",
    "options": [
      "ការបិទប្រាក់កម្ចីអនឡាញ",
      "ការហាមឃាត់ការប្រើប្រាស់ប្រាក់បរទេស",
      "ការបញ្ឈប់ការផ្តល់កម្ចី",
      "ការពង្រឹងប្រព័ន្ធធនាគារ និងបរិយាបន្នហិរញ្ញវត្ថុ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការធ្វើ « ឌីជីថលភាវូបនីយកម្ម » ក្នុងធុរកិច្ច មានសារៈសំខាន់យ៉ាងណា?",
    "options": [
      "ដើម្បីបង្កើនផលិតភាព និងប្រសិទ្ធភាពអាជីវកម្ម",
      "ដើម្បីឱ្យមើលទៅទំនើប",
      "ដើម្បីកាត់បន្ថយបុគ្គលិក",
      "ដើម្បីគេចវេសពន្ធ"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើយន្តការអ្វីដែលត្រូវប្រើដើម្បីដោះស្រាយវិវាទពាណិជ្ជកម្ម?",
    "options": [
      "ការតវ៉ាតាមផ្លូវតុលាការ",
      "តុលាការពាណិជ្ជកម្ម និងយន្តការក្រៅប្រព័ន្ធតុលាការ",
      "អាជ្ញាធរជាតិដោះស្រាយវិវាទក្រៅប្រពន្ធតុលាការ",
      "ក្រសួងពាណិជ្ជកម្ម"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "ការវិនិយោគផ្ទាល់ពីបរទេសក្នុងទម្រង់ណា ដែលត្រូវបានលើកទឹកចិត្ត ៖",
    "options": [
      "ការវិនិយោគរយៈពេលខ្លី",
      "ការវិនិយោគលើវិស័យកាត់ដេរ",
      "វិនិយោគដែលមានគុណភាព និងបង្កើតការងារ",
      "ការវិនិយោគលើរ៉ែ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើបញ្ចកោណទី ៤ នៃយុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់ទី ១ ផ្តោតសំខាន់លើបញ្ហាអ្វី?",
    "options": [
      "បច្ចេកវិទ្យាឌីជីថល",
      "ការអប់រំ និងកីឡា",
      "ពាណិជ្ជកម្មអន្តរជាតិ",
      "ការអភិវឌ្ឍប្រកបដោយភាពធន់ ចីរភាព និងបរិយាបន្ន"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការគ្រប់គ្រងធនធានធម្មជាតិ និងបរិស្ថាន ត្រូវធ្វើឡើងក្នុងទិសដៅអ្វី?",
    "options": [
      "ធានាចីរភាព និងការការពារប្រព័ន្ធអេកូឡូស៊ី",
      "ការការពារការប្រែប្រួលអាកាសធាតុជាសកល",
      "ទប់ស្កាត់ការប្រែប្រួលអាកាសធាតុ",
      "មិនឱ្យមានការអភិវឌ្ឍន៍អ្វីទាំងអស់"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើគោលដៅសម្រាប់ « កម្ពុជាគ្មានមីន » គឺនៅឆ្នាំណា?",
    "options": [
      "២០២៣",
      "២០២៥",
      "២០២៨",
      "២០៣០"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការអភិវឌ្ឍជនបទ មានគោលដៅសំខាន់អ្វី?",
    "options": [
      "ផ្លាស់ប្ដូរជនបទ ទៅជាទីក្រុង",
      "បង្កើតទីក្រុងថ្មី",
      "កាត់បន្ថយគម្លាតរវាងទីក្រុង និងជនបទ",
      "បង្កើតផ្សាទំនើបនៅតាមជនបទ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើ « សេដ្ឋកិច្ចបៃតង » សំដៅលើអ្វី?",
    "options": [
      "សេដ្ឋកិច្ចដែលពឹងផ្អែកលើផលិទ្ធផលកសិកម្ម",
      "សេដ្ឋកិច្ចដែលពឹងផ្អែកលើព្រៃឈើ",
      "សេដ្ឋកិច្ចសេរីនិយម",
      "សេដ្ឋកិច្ចដែលកាត់បន្ថយផលប៉ះពាល់បរិស្ថាន និងការប្រែប្រួលអាកាសធាតុ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើចលនាអ្វីដែលត្រូវបានជំរុញនៅក្នុងការអភិវឌ្ឍភូមិឋាន?",
    "options": [
      "ភូមិស្អាត និងមានសុវត្ថិភាព",
      "ភូមិមួយ ផលិតផលមួយ",
      "ភូមិគ្មានគ្រឿងញៀន",
      "ត្រូវទាំងអស់"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការគ្រប់គ្រងសំណល់រឹង - រាវ នៅទីប្រជុំជន គឺជាការទទួលខុសត្រូវរបស់នរណា?",
    "options": [
      "ក្រុមហ៊ុនប្រមូលសំរាម",
      "រដ្ឋបាលថ្នាក់ក្រោមជាតិ និងការចូលរួមពីប្រជាពលរដ្ឋ",
      "ក្រសួងបរិស្ថាន",
      "អង្គការក្រៅរដ្ឋាភិបាល"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការប្រែប្រួលអាកាសធាតុ ត្រូវបានចាត់ទុកជាបញ្ហាបែបណានៅក្នុងយុទ្ធសាស្ត្របញ្ចកោណ?",
    "options": [
      "បញ្ហាតូចតាច",
      "បញ្ហារបស់ប្រទេសអ្នកមាន",
      "បញ្ហាអន្តរវិស័យ",
      "បញ្ហាដែលមិនអាចដោះស្រាយបាន"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការធ្វើទំនើបកម្មដែនដី និងនគរូបនីយកម្ម មានគោលដៅអ្វី?",
    "options": [
      "សាងសង់អគារពាណិជ្ជកម្មឱ្យច្រើន",
      "បង្កើតតំបន់ទេសចរណ៍ក្នុងទីក្រុង",
      "ចុះបញ្ជីដីធ្លីឱ្យបានគ្រប់ក្បាលដី",
      "រៀបចំទីក្រុងឱ្យមានសោភ័ណភាព សុវត្ថិភាព និងបរិស្ថានល្អ"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើអ្វីជាវិធានការចំពោះតំបន់ការពារធម្មជាតិ?",
    "options": [
      "ការពារ អភិរក្ស និងទប់ស្កាត់ការទន្ទ្រានកាន់កាប់",
      "កាត់ឆ្វៀលឱ្យប្រជាជនរស់នៅ",
      "ផ្តល់សម្បទានដីសង្គមកិច្ចបន្ថែម",
      "ត្រឹមត្រូវទាំងអស់"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "បញ្ចកោណទី ៥ គឺជាការបន្ថែមថ្មី ដើម្បីឆ្លើយតបនឹង ៖",
    "options": [
      "វិបត្តិសេដ្ឋកិច្ចសកល",
      "បដិវត្តន៍ឧស្សាហកម្មទី ៤ និងបរិវត្តកម្មឌីជីថល",
      "ការកើនឡើងនៃចំនួនប្រជាជន",
      "ការខ្វះខាតកម្លាំងពលកម្ម"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "អ្វីជាសមាសធាតុសំខាន់ នៃសេដ្ឋកិច្ច និងសង្គមឌីជីថល ៖",
    "options": [
      "ទូរស័ព្ទ កុំព្យូទ័រ និងអ៊ីនធឺណិត",
      "Facebook, Telegram និង TikTok",
      "រដ្ឋាភិបាលឌីជីថល, ពលរដ្ឋឌីជីថល និង ធុរកិច្ចឌីជីថល",
      "ធនាគារ, ក្រុមហ៊ុន និងរោងចក្រ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើ « រដ្ឋាភិបាលឌីជីថល » មានគោលបំណងអ្វី?",
    "options": [
      "ដើម្បីឱ្យប្រជាពលរដ្ឋចេះប្រើប្រាស់បណ្ដាញសង្គម",
      "ដើម្បីកាត់បន្ថយចំនួនមន្ត្រីរាជការក្នុងក្រសួង ស្ថាប័ន",
      "ដើម្បីឱ្យមន្ត្រីរាជការចេះប្រើបច្ចេកវិទ្យា",
      "ដើម្បីផ្តល់សេវាសាធារណៈឱ្យកាន់តែមានប្រសិទ្ធភាព តម្លាភាព និងងាយស្រួល"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការកសាង « ហេដ្ឋារចនាសម្ព័ន្ធឌីជីថល » រួមបញ្ចូលអ្វីខ្លះ?",
    "options": [
      "ការតភ្ជាប់បណ្តាញអ៊ីនធឺណិតល្បឿនលឿន និងមជ្ឈមណ្ឌលទិន្នន័យ",
      "ការសាងសង់បង្គោលសេវាអ៊ីនធឺណិតតាមបណ្ដាលជនបទ",
      "ការតម្លើងប្រព័ន្ធ 5G",
      "ការដំឡើងបង្គោលភ្លើង"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការអភិវឌ្ឍ « បច្ចេកវិទ្យាហិរញ្ញវត្ថុ » ផ្តល់ផលប្រយោជន៍អ្វី?",
    "options": [
      "បង្កើតយន្តការកម្ចីអនឡាញ",
      "សម្រួលការទូទាត់សងប្រាក់ និងបរិយាបន្នហិរញ្ញវត្ថុ",
      "លុបបំបាត់ការប្រើប្រាស់សាច់ប្រាក់សុទ្ធ",
      "ដើម្បីបង្កើតការប្រកួតប្រជែងក្នុងវិស័យធនាគារ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "កត្តាចាំបាច់ដើម្បីជំរុញសេដ្ឋកិច្ចឌីជីថល គឺ ៖",
    "options": [
      "ការបង្កើនល្បឿន Internet",
      "ការទិញទំនិញតាមអនឡាញ",
      "ការកសាងភាពជឿទុកចិត្តលើប្រព័ន្ធឌីជីថល (សន្តិសុខសាយប័រ)",
      "ការប្រើប្រាស់បច្ចេកវិទ្យា AI"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "« ពលរដ្ឋឌីជីថល » ត្រូវមានលក្ខណៈសម្បត្តិ ៖",
    "options": [
      "មានទូរស័ព្ទដៃទំនើប",
      "ការទូទាត់សាច់ប្រាក់តាមអនឡាញ",
      "មានគណនីបណ្តាញ",
      "មានចំណេះដឹង និងជំនាញឌីជីថល"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "ការធ្វើពាណិជ្ជកម្មតាមប្រព័ន្ធអេឡិចត្រូនិក (E-commerce) នឹងត្រូវបានជំរុញតាមរយៈ ៖",
    "options": [
      "ការបង្កើតច្បាប់ និងលិខិតបទដ្ឋានគតិយុត្ត",
      "ការលើកលែងពន្ធលើទំនិញអនឡាញ",
      "ការបិទក្រុមហ៊ុនដឹកជញ្ជូន",
      "ការហាមឃាត់ការផ្សាយពាណិជ្ជកម្ម"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើ « មជ្ឈមណ្ឌលទិន្នន័យជាតិ (National Data Center) » មានសារៈសំខាន់ដូចម្តេច?",
    "options": [
      "សម្រាប់ទុកឯកសារសម្ងាត់",
      "ជាឆ្អឹងខ្នងនៃការគ្រប់គ្រងទិន្នន័យរបស់រដ្ឋាភិបាលឌីជីថល",
      "សម្រាប់ឱ្យក្រុមហ៊ុនឯកជនជួល",
      "មិនមានសារៈសំខាន់ទេ"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើការចាប់យកបច្ចេកវិទ្យាឌីជីថល ត្រូវបានចាត់ទុកជា ៖",
    "options": [
      "ការគំរាមកំហែងដល់សន្តិសុខជាតិ",
      "ការគំរាមកំហែងដល់វប្បធម៌",
      "កាលានុវត្តភាពដើម្បីលោតផ្លោះក្នុងការអភិវឌ្ឍ",
      "ត្រឹមត្រូវទាំងអស់"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើកម្មវិធីគោលនយោបាយអាទិភាពទី ១ គឺទាក់ទងនឹងអ្វី?",
    "options": [
      "ការបណ្តុះបណ្តាលវិជ្ជាជីវៈ",
      "ការផ្តល់ជំនួយសង្គម",
      "វិស័យកសិកម្ម",
      "ការផ្តល់ការថែទាំសុខភាពឆ្ពោះទៅរកការគ្របដណ្តប់សុខភាពជាសកល"
    ],
    "correct": 3,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើកម្មវិធីបណ្តុះបណ្តាលជំនាញវិជ្ជាជីវៈ និងបច្ចេកទេស (TVET) មានគោលដៅផ្តល់ជូនយុវជនមកពីគ្រួសារក្រីក្រចំនួនប៉ុន្មាននាក់?",
    "options": [
      "១.៥ លាននាក់",
      "១ លាននាក់",
      "២ លាននាក់",
      "២.៥ លាននាក់"
    ],
    "correct": 0,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "នៅក្នុងកម្មវិធីគោលនយោបាយអាទិភាពទី៣ តើកម្មវិធីជាតិជំនួយសង្គម នឹងត្រូវធ្វើស្ថាប័នូបនីយកម្មសម្រាប់ជួយនរណា?",
    "options": [
      "មន្ត្រីរាជការ",
      "គ្រួសារក្រីក្រ និងក្រុមជនងាយរងគ្រោះ",
      "អាជីវករ",
      "សិស្សសាលាឯកជន"
    ],
    "correct": 1,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើកម្មវិធីគោលនយោបាយអាទិភាពទី៥ ទាក់ទងនឹងវិស័យកសិកម្ម គឺផ្តោតលើអ្វី?",
    "options": [
      "ការចែកដីជូនកសិករ",
      "ការទិញកសិផលទាំងអស់ពីកសិករ",
      "យន្តការសម្របសម្រួល និងកម្មវិធីហិរញ្ញប្បទាន ដើម្បីលើកស្ទួយផលិតកម្ម រកទីផ្សារ និងរក្សាលំនឹងថ្លៃកសិផល",
      "ការហាមឃាត់ការនាំចូលបន្លែ"
    ],
    "correct": 2,
    "isActive": true
  },
  {
    "subject": "យុទ្ធសាស្ត្របញ្ចកោណ-ដំណាក់កាលទី១",
    "question": "តើកម្មវិធីគោលនយោបាយអាទិភាពទី៦ គឺការដាក់ពង្រាយមន្ត្រីអ្វីទៅតាមឃុំ-សង្កាត់?",
    "options": [
      "មន្ត្រីបច្ចេកទេសកសិកម្ម",
      "មន្ត្រីនគរបាល",
      "មន្ត្រីសុខាភិបាល",
      "មន្ត្រីអប់រំ"
    ],
    "correct": 0,
    "isActive": true
  }
];